package by.it.hutnik.javazadachi_com;

import java.util.Arrays;

/*
Для проверки остаточных знаний учеников после летних каникул, учитель младших классов решил начинать каждый
урок с того, чтобы задавать каждому ученику пример из таблицы умножения, но в классе 15 человек, а примеры
среди них не должны повторяться. В помощь учителю напишите программу, которая будет выводить на экран 15
случайных примеров из таблицы умножения (от 2*2 до 9*9, потому что задания по умножению на 1 и на 10 — слишком
просты). При этом среди 15 примеров не должно быть повторяющихся (примеры 2*3 и 3*2 и им подобные пары
считать повторяющимися).
 */
public class Task_6_18 {
    public static void main(String[] args) {
        String[][] rowStr = new String[][]{
            {"2x2=", "2x3=", "2x4=", "2x5=", "2x6=", "2x7=", "2x8=", "2x9="},
            {"3x2=", "3x3=", "3x4=", "3x5=", "3x6=", "3x7=", "3x8=", "3x9="},
            {"4x2=", "4x3=", "4x4=", "4x5=", "4x6=", "4x7=", "4x8=", "4x9="},
            {"5x2=", "5x3=", "5x4=", "5x5=", "5x6=", "5x7=", "5x8=", "5x9="},
            {"6x2=", "6x3=", "6x4=", "6x5=", "6x6=", "6x7=", "6x8=", "6x9="},
            {"7x2=", "7x3=", "7x4=", "7x5=", "7x6=", "7x7=", "7x8=", "7x9="},
            {"8x2=", "8x3=", "8x4=", "8x5=", "8x6=", "8x7=", "8x8=", "8x9="},
            {"9x2=", "9x3=", "9x4=", "9x5=", "9x6=", "9x7=", "9x8=", "9x9="},
        };
        int count = 0;
        String strRow;
//        for (String[] x: rowStr){
//            System.out.println(Arrays.toString(x));
//        }
        System.out.println();
        for (int i = 0; i < 15; i++) {
            int a = (int) (Math.random() * 8);
            int b = (int) (Math.random() * 8);
            if(rowStr[a][b] == null){
                i--;
                continue;
            }
            strRow = rowStr[a][b];
            count++;
            System.out.print(count + ") " + strRow);
            System.out.println();
            rowStr[a][b] = null;
            rowStr[b][a] = null;
        }
    }
}
